blueskycoco/rtthread-nano/rt-thread/bsp/stm32f030f4p6/main.c
/*
 * Copyright (c) 2006-2019, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2019-11-05     yangjie      First edition
 */

#include <rtthread.h>
#include <stm32f0xx.h>
#include "wifi.h"

uint8_t cmd[32] = {"AT+WMODE\n"};
uint8_t e[32] = {"AT+E\n"};
uint8_t rsp[32] = {0};
uint8_t plus[] = {"+++"};
uint8_t a[] = {"a"};
uint8_t len = 0;
void led_init()
{
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
}

int main(void)
{

    led_init();
/*	wifi_tx(plus, 3);
    rt_thread_mdelay(100);
    wifi_tx(a, 1);
    //wifi_rx(rsp);
	len = 0;*/
//	wifi_tx(e, sizeof(e));
	while (1)
    {
		wifi_tx(cmd, sizeof(cmd));
		len = wifi_rx(rsp);
		if (rt_strstr((const char *)rsp, "STA") != RT_NULL) {
			GPIO_ResetBits(GPIOB,GPIO_Pin_1);
        	rt_thread_mdelay(500);
			GPIO_SetBits(GPIOB,GPIO_Pin_1);
        	rt_thread_mdelay(500);
		} else {
			GPIO_ResetBits(GPIOB,GPIO_Pin_1);
        	rt_thread_mdelay(50);
			GPIO_SetBits(GPIOB,GPIO_Pin_1);
        	rt_thread_mdelay(50);
		}
    }
}

